**فیلتر کردن سطر ها**

In [1]:
import pandas as pd

<p dir = rtl>یکی از کار هایی که در دیتا فریم میتوان انجام داد فیلتر کردن آنها است </p>

In [2]:
df = pd.read_csv( #فراخوانی یک دیتا فریم
    '../Data/nba.csv',
    index_col='Name',
    parse_dates=['Birthday'],
)
df.head()

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

<p dir=rtl>فرض کنید دیتای بالارو نداریم فقط همین 5 سطر اول رو داریم که اون رو با (ایلوک) جدا میکنیم <p>

In [3]:
A = df.iloc[:5] # فراخوانی پنج سطر اول # از ابتدا تا پنجمی
A

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

<p dir = rtl>فرض کنید آنهایی که دی اف هستند را می خواهیم جدا کنیم</p>

In [4]:
A.iloc[[1,2]] # یک نوع روش با اسفاده از اندیس گذاری

                             Team Position   Birthday   Salary
Name
Christian Wood    Detroit Pistons       PF 1995-09-27  1645357
PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840

In [5]:
A.iloc[[False, True, True, False, False]] # روش بعدی مدل بولین اندیس گذاری میکنیم

                             Team Position   Birthday   Salary
Name
Christian Wood    Detroit Pistons       PF 1995-09-27  1645357
PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840

<p dir=rtl> نکته : در بولین میتوان -ای لوک - را استفاده نکرد<p>

In [6]:
A[[False, True, True, False, False]]

                             Team Position   Birthday   Salary
Name
Christian Wood    Detroit Pistons       PF 1995-09-27  1645357
PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840

<p dir=rtl>حالا باید شرط بسازیم همیشه که نمیتوان به صورت دستی نوشت .<p>

In [7]:
A['Position']

Name
Shake Milton      SG
Christian Wood    PF
PJ Washington     PF
Derrick Rose      PG
Marial Shayok      G
Name: Position, dtype: object

<p dir = rtl>الان در این کار یک سری رو با یک مقدار مقایسه کردیم</p>

In [8]:
A['Position'] == 'PF' # از اپراتور های مقایسه ایی استفاده میکنیم

Name
Shake Milton      False
Christian Wood     True
PJ Washington      True
Derrick Rose      False
Marial Shayok     False
Name: Position, dtype: bool

In [9]:
A[A['Position'] == 'PF'] # کل عبارت رو به عنوان یک اندیس منطقی میگیریم

                             Team Position   Birthday   Salary
Name
Christian Wood    Detroit Pistons       PF 1995-09-27  1645357
PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840

In [10]:
list(A['Position'] == 'PF') # یک لیست هم میتوان ساخت

[False, True, True, False, False]

<p dir=rtl> - در این روش یک مقدار تعیین میکنیم که میگوییم مقدار -ای- رو بریز داخل -ایز پی اف <p>

In [11]:
is_pf = (A['Position'] == 'PF') 
A[is_pf]

                             Team Position   Birthday   Salary
Name
Christian Wood    Detroit Pistons       PF 1995-09-27  1645357
PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840

<p dir=rtl>یک کپی از دیتا فریم تهیه میکنیم</p>

In [12]:
B = df.iloc[:5] #از ابتدا تا پنجمی

In [13]:
B

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

<p dir = rtl>فرض کنید ما همون شرط رو داریم</p>

In [14]:
B['Position'] == 'PF'

Name
Shake Milton      False
Christian Wood     True
PJ Washington      True
Derrick Rose      False
Marial Shayok     False
Name: Position, dtype: bool

<p dir = rtl>اگر به جای دو مساوی از یک مساوی استفاده کنیم به ما خطا می دهد و تمام پوزیشن هارو- پی اف -میکند</p>

In [15]:
B['Position'] = 'PF'

C:\Users\smk\AppData\Local\Temp\ipykernel_2620\2936201702.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  B['Position'] = 'PF'

In [16]:
B

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       PF 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PF 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers       PF 1995-07-26    79568

In [17]:
df[df['Position'] == 'PF'] #  پوزیشن هایی رو نشان بده که پی اف هستند و 96 تا این حالت رو دارند

                                      Team Position   Birthday    Salary
Name
Christian Wood             Detroit Pistons       PF 1995-09-27   1645357
PJ Washington            Charlotte Hornets       PF 1998-08-23   3831840
Draymond Green       Golden State Warriors       PF 1990-03-04  18539130
JaMychal Green        Los Angeles Clippers       PF 1990-06-21   4767000
Chris Boucher              Toronto Raptors       PF 1993-01-11   1588231
...                                    ...      ...        ...       ...
Semi Ojeleye                Boston Celtics       PF 1994-12-05   1618520
Brandon Ingram        New Orleans Pelicans       PF 1997-09-02   7265485
Dorian Finney-Smith       Dallas Mavericks       PF 1993-05-04   4000000
Jared Dudley            Los Angeles Lakers       PF 1985-07-10   2564753
Harry Giles               Sacramento Kings       PF 1998-04-22   2578800

[96 rows x 4 columns]

<p dir=rtl>میتوان آنهارا -دیسکرایب - کرد چون تنها چیز قابل توصیف حقوق هست نمایش میده</p>

In [18]:
df[df['Position'] == 'PF'].describe()

             Salary
count  9.600000e+01
mean   7.223614e+06
std    9.201600e+06
min    7.956800e+04
25%    1.645357e+06
50%    3.240460e+06
75%    8.140762e+06
max    3.743686e+07

In [19]:
df[df['Position'] == 'PF']['Salary'].mean() # گرفتن میانگین

7223613.5

<p dir = rtl>این ها امکاناتی هستند که در پانداس وجود دارد که میتونه به ما کمک کنه که بخش هایی از دیتا رو با شرط هایی مناسب با استفاده -لاجیکال ایندکسینگ - جدا کنید و انتخاب کنید </p>

In [20]:
df[df['Position'] == 'G']['Salary'].mean()

372833.4

<p dir=rtl>-دی اف 2 - رو لود میکنم </p>

In [21]:
df2 = pd.read_csv(
    '../Data/employees.csv',
    index_col='First Name',
    parse_dates=['Start Date'],
)
df2.head()

            Gender Start Date    Salary   Mgmt       Team
First Name
Douglas       Male 1993-08-06       NaN   True  Marketing
Thomas        Male 1996-03-31   61933.0   True        NaN
Maria       Female        NaT  130590.0  False    Finance
Jerry          NaN 2005-03-04  138705.0   True    Finance
Larry         Male 1998-01-24  101004.0   True         IT

In [23]:
df2['Mgmt'].astype('bool') # افرادی و انتخاب میکنیم که جزو مدیران هستند و نوع آن را بولین میکنیم

First Name
Douglas     True
Thomas      True
Maria      False
Jerry       True
Larry       True
           ...
Phillip    False
Russell    False
Larry      False
Albert      True
NaN         True
Name: Mgmt, Length: 1001, dtype: bool

In [24]:
df2['Mgmt'] = df2['Mgmt'].astype('bool') #کامل قسمت مدیران نوعش رو بولین میکنیم

In [25]:
df2.dtypes # نوع دیتا رو اگر مشاهده کنیم نوع منجمت بولین شده

Gender                object
Start Date    datetime64[ns]
Salary               float64
Mgmt                    bool
Team                  object
dtype: object

In [26]:
df2[df2['Mgmt'] == True] # آنهایی که مقدارشون ترو هست رو نشون بده

            Gender Start Date    Salary  Mgmt         Team
First Name
Douglas       Male 1993-08-06       NaN  True    Marketing
Thomas        Male 1996-03-31   61933.0  True          NaN
Jerry          NaN 2005-03-04  138705.0  True      Finance
Larry         Male 1998-01-24  101004.0  True           IT
Ruby        Female 1987-08-17   65476.0  True      Product
...            ...        ...       ...   ...          ...
Anthony       Male 2011-10-16  112769.0  True      Finance
Tina        Female 1997-05-15   56450.0  True  Engineering
George        Male 2013-06-21   98874.0  True    Marketing
Albert        Male 2012-05-15  129949.0  True        Sales
NaN            NaN        NaT       NaN  True          NaN

[536 rows x 5 columns]

<p dir=rtl>مقایسه با -ترو- زیاد معنایی نداره چون ارزش هاشون برابر هست خودشون به صورت شرط میتوانند وارد بشن</p>

In [27]:
df2[df2['Mgmt']]

            Gender Start Date    Salary  Mgmt         Team
First Name
Douglas       Male 1993-08-06       NaN  True    Marketing
Thomas        Male 1996-03-31   61933.0  True          NaN
Jerry          NaN 2005-03-04  138705.0  True      Finance
Larry         Male 1998-01-24  101004.0  True           IT
Ruby        Female 1987-08-17   65476.0  True      Product
...            ...        ...       ...   ...          ...
Anthony       Male 2011-10-16  112769.0  True      Finance
Tina        Female 1997-05-15   56450.0  True  Engineering
George        Male 2013-06-21   98874.0  True    Marketing
Albert        Male 2012-05-15  129949.0  True        Sales
NaN            NaN        NaT       NaN  True          NaN

[536 rows x 5 columns]